spec/vcr/create_a_recurring_order/without_recurring_argument/has_recurring_attribute_set_to_true.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.playground.klarna.com/checkout/v3/orders/
    body:
      encoding: UTF-8
      string: '{"purchase_country":"SE","purchase_currency":"SEK","locale":"sv-SE","order_amount":9900,"order_tax_amount":1980,"order_lines":[{"type":"digital","reference":"11111","name":"Funny
        Service","quantity":1,"unit_price":9900,"tax_rate":2500,"total_amount":9900,"total_discount_amount":0,"total_tax_amount":1980}],"merchant_urls":{"id":"57141","terms":"http://www.example.com/terms","checkout":"http://www.example.com/checkout","confirmation":"http://www.example.com/confirmation_uri","push":"http://www.example.com/push"}}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - Basic <base64 string>
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message:
    headers:
      date:
      - Thu, 20 Aug 2020 19:52:18 GMT
      content-type:
      - application/json
      content-length:
      - '4393'
      connection:
      - keep-alive
      server:
      - openresty
      cache-control:
      - max-age=0, no-cache, no-store
      pragma:
      - no-cache
      klarna-correlation-id:
      - cbd563fa-b81a-4a61-bb30-a60f2e414d21
      location:
      - https://api.playground.klarna.com/checkout/v3/orders/a8300100-ca6f-68c4-9f9f-c3e3b132b0a4
      render-time:
      - '22'
      strict-transport-security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: UTF-8
      string: '{"order_id":"a8300100-ca6f-68c4-9f9f-c3e3b132b0a4","status":"checkout_incomplete","purchase_country":"se","purchase_currency":"SEK","locale":"sv-SE","billing_address":{"country":"se"},"customer":{},"shipping_address":{"country":"se"},"order_amount":9900,"order_tax_amount":1980,"order_lines":[{"type":"digital","reference":"11111","name":"Funny
        Service","quantity":1,"unit_price":9900,"tax_rate":2500,"total_amount":9900,"total_discount_amount":0,"total_tax_amount":1980}],"merchant_urls":{"terms":"http://www.example.com/terms","checkout":"http://www.example.com/checkout","confirmation":"http://www.example.com/confirmation_uri","push":"http://www.example.com/push"},"html_snippet":"<div
        id=\"klarna-checkout-container\" style=\"overflow-x: hidden;\">\n  <div id=\"klarna-unsupported-page\">\n  <style
        type=\"text/css\">\n  @-webkit-keyframes klarnaFadeIn{from{opacity:0}to{opacity:1}}@-moz-keyframes
        klarnaFadeIn{from{opacity:0}to{opacity:1}}@keyframes klarnaFadeIn{from{opacity:0}to{opacity:1}}#klarna-unsupported-page{opacity:0;opacity:1\\9;-webkit-animation:klarnaFadeIn
        ease-in 1;-moz-animation:klarnaFadeIn ease-in 1;animation:klarnaFadeIn ease-in
        1;-webkit-animation-fill-mode:forwards;-moz-animation-fill-mode:forwards;animation-fill-mode:forwards;-webkit-animation-duration:.1s;-moz-animation-duration:.1s;animation-duration:.1s;-webkit-animation-delay:5s;-moz-animation-delay:5s;animation-delay:5s;text-align:center;padding-top:64px}#klarna-unsupported-page
        .heading{font-family:Source Sans Pro,Helvetica,Arial,sans-serif;line-height:48px;font-weight:200;color:#303030;font-size:42px;margin:24px
        0}#klarna-unsupported-page .subheading{font-family:Source Sans Pro,Helvetica,Arial,sans-serif;line-height:28px;font-weight:400;color:rgba(0,0,0,.7);font-size:19px;max-width:560px;margin:10px
        auto}#klarna-unsupported-page .subheading a{text-decoration:none;background-color:transparent;border:0;color:rgba(0,0,0,.7);font-weight:600}\n  </style>\n  <h1
        class=\"heading\">Oops.</h1>\n    <p class=\"subheading\">It looks like an
        important part of the checkout experience failed to load and we are unable
        to offer you a way to pay right now.</p>\n    <p class=\"subheading\">Please
        refresh the page to try again. If this isn''t the first time you''ve seen
        this message then there may be a more permanent error and you should contact
        customer service at Klarna.com.</p>\n  </div>\n  <script type=\"text/javascript\">\n  /*
        <![CDATA[ */\n  (function(w,k,i,d,n,c,l){\n    w[k]=w[k]||function(){(w[k].q=w[k].q||[]).push(arguments)};\n    l=w[k].config={\n      container:w.document.getElementById(i),\n      ORDER_URL:''https://js.playground.klarna.com/eu/kco/checkout/orders/a8300100-ca6f-68c4-9f9f-c3e3b132b0a4'',\n      AUTH_HEADER:''KlarnaCheckout
        urrvp8520mf6tlvz2y77'',\n      LOCALE:''sv-SE'',\n      ORDER_STATUS:''checkout_incomplete'',\n      MERCHANT_TAC_URI:''http://www.example.com/terms'',\n      MERCHANT_NAME:''Your
        business name'',\n      HASHED_MERCHANT_ID:''0383d93cfb4516bf62523038946fe147'',\n      GUI_OPTIONS:[],\n      ALLOW_SEPARATE_SHIPPING_ADDRESS:false,\n      PURCHASE_COUNTRY:''swe'',\n      PURCHASE_CURRENCY:''SEK'',\n      TESTDRIVE:true,\n      CHECKOUT_DOMAIN:''https://checkout-eu.playground.klarna.com'',\n      BOOTSTRAP_SRC:''https://js.playground.klarna.com/kcoc/200820-a74cc7f/checkout.bootstrap.js'',\n      CLIENT_EVENT_HOST:''https://eu.playground.klarnaevt.com'',\n      LIQUORICE_ENABLED:false,\n      CONDENSED_ENABLED:false\n    };\n    n=d.createElement(''script'');\n    c=d.getElementById(i);\n    n.async=!0;\n    n.src=l.BOOTSTRAP_SRC;\n    c.appendChild(n);\n    try{\n      ((w.Image
        && (new w.Image))||(d.createElement && d.createElement(''img''))||{}).src
        =\n        l.CLIENT_EVENT_HOST + ''/v1/checkout/snippet/load'' +\n        ''?sid=''
        + l.ORDER_URL.split(''/'').slice(-1) +\n        ''&order_status='' + w.encodeURIComponent(l.ORDER_STATUS)
        +\n        ''&timestamp='' + (new Date).getTime();\n    }catch(e){}\n  })(this,''_klarnaCheckout'',''klarna-checkout-container'',document);\n  /*
        ]]> */\n  </script>\n  <noscript>\nPlease <a href=\"http://enable-javascript.com\">enable
        JavaScript</a>.\n  </noscript>\n</div>","started_at":"2020-08-20T19:52:18Z","last_modified_at":"2020-08-20T19:52:18Z","options":{"allow_separate_shipping_address":false,"date_of_birth_mandatory":false,"require_validate_callback_success":false},"external_payment_methods":[],"external_checkouts":[]}'
  recorded_at: Thu, 20 Aug 2020 19:52:18 GMT
recorded_with: VCR 6.0.0
